package kkb.exam.constants;

public enum CommonSpec {
	DEFAULT_ENCODING("UTF-8"),
	CSV_FILE_NAME("/etc/comments.csv"),
	FIND_NAME_ARRAY("FIND_NAME_ARRAY", new String[]{"초등학교", "초", "중학교", "중",  "고등학교", "고", "대학교"}),
//	FIND_NAME_ARRAY("FIND_NAME_ARRAY", new String[]{"초등학교", "중학교", "고등학교", "대학교"}),
	REMOVE_WORD_ARRAY("", new String[]{
					  //etc
					  "❤",
					  //조사 및 접속사 
					  "를","그리고", "그런데", "그래서", "그렇다고", "글고", "그렇고", "나중에",  "그중에",  
					  //명사 및 대명사
					  "짜장면", "초딩", "중딩", "고딩", "대딩","나초롬", "문초록", "댓글","서초현", "울초", "김초은", "최초","초등학생", "중학생", "고등학생", "대학생",
					  "김현중", "최윤라", "김효중", "김민중","기말","꼭대기","예비", "이상민","여중아이들", "윤혜란", "고수희", "김유나고", "최고",
					  "기본중","학교중", "공부중", "사용중", "학생중", "식중독", "학년중", "로딩중",  "재학중", "기억중", "년중", "남중도", "여중도", 
					  "저희", "우리", "힘든","진짜", "아닌", "골고루", "광고에서","백번이고", "문제고", "시험기간이고", "시험을보고", "시험이고", "학교고",
					  "은홍강은비강전수진전전고", "제발요", "자장면이", "마지막초","중간고사", "기말고사", 
					  //서술어 및 동사, 형용사
					  "십습니다", "입니다", "합니다", "같아요",  "내려주시와요", "먹고어요중","고픕니다","채워지고", "맛잇다고","도와주고", "안됀다고","보시고",
					  "움직이고","태우고","만들어주고","주세용", "주시고", "마치고", "하시고", "나오고", "뽑히고", "아프고", "나누고", "드리고","사주심다고", 
					  "마르고", "달래고", "모르고", "시키고", "다니고",  "어디고", "찌들고", "이쁘고", "망치고", "귀엽고", "힘들고", "배우고", "화내는", 
					  "한다고", "좋아요",  "할께요", "보내고", "남기고", "바르고", "아니고", "만들고", "부수고", "새기고", "지키고", "예쁘고", "시키고", 
					  "남기고", "배고픈와중", "됩니다", "못먹고", "가틍데", "스럽고", "있었고", "두렵고", "아프고", "누르고", "미루고", "태그고", "같습니다", 
					  "마시고", "넘쳐나고", "힘내고", "해지고", "다이고", "맛보고", "먹으시고", "아시고", "간다고", "준비고", "넓어지고", "잘보고", "대박나고",
					  "한마음이고", "먹겠고", "같다고", "깨지고", "돼지고", "힘이나고", "풀리고","지나고", "노맛이고", "먹어보고", "드시고", "안됬다고",
					  "적어지고", "떨어뜨리고", "해보고", "때리고", "많아지고", "힘들었고", "구리고", "걸린다고", "더러워지고", "지리고", "안주고", "눌러주고", 
					  "듣는다고", "깔보고", "끝내고", "끝내시고", "보이고", "조금주고", "된다고", "최고", "덜고", "되주고", "단합이고","모습보고", "기다리고",
					  "먹겠고", "활기차고", "못하는", "생기고", "채우고", "똥싸는중", "소중한", "이용중인데", "다른중보다", "와중에", "이번에", "가지고", "것이고",
					  "짓는다고", "굶주리고", "길어지고", "끝나고", "나누시고", "내고싶네요", "널리고", "느끼고", "달리고", "늘러주고", "고맙고", "떨어지고",
					  "먹겟고", "부러지고", "먹여두리고", "고고", "부르시고", "하다고", "터지고" ,"하겠고","싶다고", "사주신다고", "주신다고", "즐겁고", "지어지고",
					  "프고", "프다고", "허덕이고", "굴리고", "없다고", "없어지고", "온다고", "신경질내고", "추워지고", "났다고",
					  "먹고", "하고", "좋고","라고", "같고", "되고", "않고", "쓰고", "없고", "참고", "려고", "박고", "타고", 
					  "오고", "가고", "놓고","받고", "있고", "뭐고", "놀고", "치고", "망고",  "꾸고", "크고", "두고", "손홍고", "얻고", "씻고", "웃고",
					  "얹고", "승기고", "찌고","말고", "굶고", "롭고", "째고", "크고",  "입고", "수고", "너무", "아니", "냐고", "찌고", "겪고", "항상", 					  
					  "배고", "잊고", "맞고", "집중", "밝고", "깔고", "알고", "달고", "들고", "밀고", "인가는", "넣고", "잇고", "쌓고", 
					  "적고", "믿고", "싸고", "싶고", "풀고", "뿌고", "좁고",  "듣고", "작고", 
					  
	}),
	REMOVE_SEPECIFIC_WORD_ARRAY("", new String[]{
						"신고","안고", "예고", "이고", "주고", "벌고", "보고"
	});
	
	
	private String name;
	private String[]attribute;
	
	private CommonSpec(String name) {
		this.name = name;
		this.attribute = null;
	}
	
	private CommonSpec(String name, String[]attribute) {
		this.name = name;
		this.attribute = attribute;
	}
	public String getName() {
		return name;
	}
	public String[] getAttribute() {
		return attribute;
	}
}
