package kkb.exam.constants;

public enum CommonSpec {
	DEFAULT_ENCODING("UTF-8"),
	CSV_FILE_NAME("/etc/comments.csv"),
//	FIND_NAME_ARRAY("FIND_NAME_ARRAY", new String[]{"초등학교", "초", "중학교", "중",  "고등학교", "고", "대학교"}),
	FIND_NAME_ARRAY("FIND_NAME_ARRAY", new String[]{"초등학교", "중학교", "고등학교", "대학교"}),
	REMOVE_WORD_ARRAY("", new String[]{
					  "입니다", "합니다", "같아요", "저희", "우리", "힘든", "짜장면", "를", "내려주시와요", "최초", "초딩", "중딩", "고딩", "대딩",
					  "나초롬", "문초록", "댓글은", "진짜", "아닌", "서초현", "울초", "김초은", "기본중","학교중", "공부중", "사용중", "학생중", "식중독",
					  "초등학생", "중학생", "고등학생", "대학생", "화내는", "예비", "주세용", "못하는", "남중도", "여중도", "나중에", "김현중", "먹고어요중",
					  "소중한", "이용중인데", "다른중보다", "와중에", "여중아이들", "로딩중", "배고픈와중", "재학중", "기억중", "그렇고", "김민중", "년중", "이번에",
					  "학년중", "못먹고", "가틍데", "똥싸는중", "그중에", "좋아요", "김효중", "할께요", "먹고", "한다고", "하고", "좋고", "하시고", "나오고", "라고",
					  "같고", "최윤라", "아프고", "되고", "않고", "쓰고", "없고", "참고", "려고", "보시고", "고픕니다", "채워지고", "맛잇다고","도와주고", "안됀다고",
					  "주시고", "마치고", "뽑히고", "박고", "나누고", "타고", "기말", "려고", "보내고", "드리고","사주심다고", "그리고", "그런데", "그래서", "움직이고",
					  "오고", "가고", "놓고","이쁘고", "망치고", "받고", "있고", "뭐고", "놀고", "마르고", "치고", "망고", "꼭대기", "꾸고", "태우고","만들어주고",
					  "스럽고", "크고", "귀엽고", "힘들고", "배우고", "찌들고", "두고", "손홍고", "얻고", "달래고", "씻고", "모르고", "시키고", "웃고",
					  "얹고", "승기고", "다니고", "찌고", "어디고", "말고", "굶고", "롭고", "남기고", "째고", "크고", "바르고", "입고", "수고", "아니고", 
					  "너무", "만들고", "부수고", "아니", "새기고", "냐고", "찌고", "지키고", "예쁘고", "겪고", "시키고", "항상", "남기고", "이상민",					  
					  "있었고", "배고", "잊고", "같습니다", "생기고", "맞고", "집중", "밝고", "두렵고", "깔고", "알고", "달고", "들고", "밀고", "인가는",
					  "적고", "믿고", "태그고", "싸고", "됩니다", "싶고", "풀고", "뿌고", "채우고", "좁고", "아프고", "듣고", "작고", "누르고", "미루고", 
					  "넣고", "최고", "글고", "먹겠고", "잇고", "활기차고", "먹겠고", "쌓고", "윤혜란", "고수희", "되주고", "단합이고","모습보고", "기다리고",
					  "마시고", "넘쳐나고", "힘내고", "해지고", "다이고", "맛보고", "먹으시고", "아시고", "간다고", "준비고", "넓어지고", "잘보고", "대박나고",
					  "한마음이고", "먹겠고", "같다고", "깨지고", "돼지고", "힘이나고", "김유나고", "그렇다고", "풀리고","지나고", "노맛이고", "먹어보고", "드시고",
					  "적어지고", "떨어뜨리고", "해보고", "때리고", "많아지고", "힘들었고", "구리고", "걸린다고", "더러워지고", "지리고", "안주고", "눌러주고", 
					  "듣는다고", "깔보고", "끝내고", "끝내시고", "보이고", "조금주고", "된다고", "최고", "덜고", "안됬다고"
	});
	
	private String name;
	private String[]attribute;
	
	private CommonSpec(String name) {
		this.name = name;
		this.attribute = null;
	}
	
	private CommonSpec(String name, String[]attribute) {
		this.name = name;
		this.attribute = attribute;
	}
	public String getName() {
		return name;
	}
	public String[] getAttribute() {
		return attribute;
	}
}
